[
  {
    "id": "argentina-programa",
    "name": "Argentina Programa",
    "role": "Java Programming Instructor",
    "startDate": "2023-03",
    "endDate": "2023-12",
    "description": "Taught Java programming fundamentals, algorithms, and problem-solving to students as part of the 4th edition of Argentina Programa, a national government initiative to expand access to software development education."
  },
  {
    "id": "mercedes-benz",
    "name": "Mercedes-Benz AG",
    "role": "Security & Data Analysis Support",
    "startDate": "2024-07",
    "endDate": "2025-09",
    "description": "Analyzed reports from security audits and compliance processes across a global organization. Collaborated with international teams in Germany, India, and Spain, developing strong technical documentation and cross-cultural communication skills."
  },
  {
    "id": "olevium",
    "name": "Olevium",
    "role": "Co-founder & Full Stack Developer",
    "startDate": "2025-01",
    "description": "Co-founded and led the technical development of a personal finance platform that automates expense tracking through WhatsApp bots and messaging integrations. Owned architecture, backend, frontend, and deployment. Built with Next.js, FastAPI, and PostgreSQL with role-based auth, background jobs, and a Dockerized development environment."
  },
  {
    "id": "fiuba",
    "name": "Faculty of Engineering – UBA",
    "role": "Full Stack Developer",
    "startDate": "2025-04",
    "endDate": "2025-11",
    "description": "Built and maintained internal systems, websites, and administrative tools for the university from the ground up. Worked across the stack with React, Next.js, Tailwind CSS, MUI, Python, PostgreSQL, and Docker."
  },
  {
    "id": "data-voices",
    "name": "Data Voices",
    "role": "Full Stack Developer",
    "startDate": "2025-09",
    "endDate": "2026-02",
    "description": "Owned end-to-end feature delivery in fast weekly release cycles from requirement gathering and technical design to production deployment. Built and integrated AI-powered features into the platform. Improved system performance and reliability through refactoring and optimization. Worked across frontend and backend with React, Node.js, and TypeScript, collaborating with desktop application teams on cross-platform integrations."
  }
]
